OpenFOAM-13/tutorials/multiphaseEuler/bubbleColumnIATE/constant/heatTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blending
{
    type            linear;
    minPartlyContinuousAlpha.air 0;
    minFullyContinuousAlpha.air 1;
    minPartlyContinuousAlpha.water 0;
    minFullyContinuousAlpha.water 1;
}

air_dispersedIn_water
{
    type            RanzMarshall;
    residualAlpha   1e-4;
}

water_dispersedIn_air
{
    type            RanzMarshall;
    residualAlpha   1e-4;
}

// ************************************************************************* //
